biletbank-updatepassengers/BILETBANK API REQUEST&RESPONSE - V2 BrandedFareItemId - RT RecommendationBox/Makeprebooking req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:trev="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Base" xmlns:trev1="http://schemas.datacontract.org/2004/07/Trevoo.WS.IO.Shopping" xmlns:trev2="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Transfer" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
	<soapenv:Header/>
	<soapenv:Body>
		<tem:MakePrebooking>
			<tem:request>
				<trev:AuthenticationHeader>
					<trev:SessionId>7434204</trev:SessionId>
					<trev:SessionToken>db14f99c-897e-4c51-8599-115813e40836</trev:SessionToken>
				</trev:AuthenticationHeader>
				<trev:ExtraParamList>
					<trev:ExtendedData>
						<trev:Name>IntendedShoppingFileId</trev:Name>
						<trev:Type>True</trev:Type>
						<trev:Value>87264cf8-dcf1-4a4d-b303-05ab97ff26b7</trev:Value>
					</trev:ExtendedData>
					<trev:ExtendedData>
						<trev:Name>DoReservation</trev:Name>
						<trev:Type>true</trev:Type>
						<trev:Value>true</trev:Value>
					</trev:ExtendedData>
				</trev:ExtraParamList>
				<trev1:Form>
					<trev1:Branded>
						<trev1:IO_Air_Branded_Form>
							<trev1:ProductId>e5cba2e2-bff7-406f-bffb-29b721e9471c</trev1:ProductId>
						</trev1:IO_Air_Branded_Form>
					</trev1:Branded>
					<trev1:CIPRequest/>
					<trev1:ExtraForm>
						<trev1:SelectedServiceFee>0</trev1:SelectedServiceFee>
					</trev1:ExtraForm>
					<trev1:CIPRequest/>
					<trev1:ProductIds>
						<arr:guid>e5cba2e2-bff7-406f-bffb-29b721e9471c</arr:guid>
					</trev1:ProductIds>
				</trev1:Form>
			</tem:request>
		</tem:MakePrebooking>
	</soapenv:Body>
</soapenv:Envelope>